### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load,encoding="utf-8")
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [2]:
players_count = len(purchase_data['SN'].unique())
players_count

576

In [3]:
totalplayers_df = pd.DataFrame({"Total Players": [players_count]})
totalplayers_df

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [4]:
#Number of Unique Items
item_count = len(purchase_data['Item Name'].unique())
item_count

179

In [5]:
#Average Purchase Price
avg_purch_price=purchase_data['Price'].mean()
avg_purch_price

3.050987179487176

In [6]:
#Total Number of Purchases
total_purchases=purchase_data["Price"].count()
total_purchases

780

In [7]:
#Total Revenue
total_revenue=purchase_data["Price"].sum()
total_revenue

2379.77

In [8]:
purchase_analysis_summary=pd.DataFrame({"Unique Items": [item_count], 
                                        "Avg Purchase Price": [avg_purch_price],
                                        "Total # of Purchases": [total_purchases], 
                                        "Total Revenue":[total_revenue]})
#Formatting
purchase_analysis_summary.style.format({'Avg Purchase Price':'${:,.2f}',
                                         'Total Revenue': '${:,.2f}'})

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [9]:
#Groupby Gender
Grouped_Gender_df=purchase_data.groupby(["Gender"])
Grouped_Gender_df.count()

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15

In [10]:
#Unique SN gender types
Total_Gender_Counts=Grouped_Gender_df["SN"].nunique()
Total_Gender_Counts

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [11]:
# % of Total
Gender_Percent_Total= Total_Gender_Counts/players_count * 100
Gender_Percent_Total

Gender
Female                   14.062500
Male                     84.027778
Other / Non-Disclosed     1.909722
Name: SN, dtype: float64

In [12]:
Gender_df=pd.DataFrame({"Total Count": Total_Gender_Counts, "Percentage of Players": Gender_Percent_Total})
Gender_df.index.name=None
Gender_df.sort_values(["Total Count"], ascending = False).style.format({'Percentage of Players':'{:.2f}%'})


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [13]:
#Total Purchase Count
Grouped_Gender_df.count()

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15

In [14]:
#Purchase Counts
Purchase_Count=Grouped_Gender_df["Purchase ID"].count()
Purchase_Count

Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [15]:
#Average Purchase by Gender
Avg_Purchase_Price=Grouped_Gender_df["Price"].mean()
Avg_Purchase_Price

Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [16]:
#Total Purchase Value by Gender
Purchase_Total=Grouped_Gender_df["Price"].sum()
Purchase_Total

Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [17]:
Avg_Purchase_Per_Person=Purchase_Total/Total_Gender_Counts
Avg_Purchase_Per_Person

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [18]:
Gender_Purchasing_df=pd.DataFrame({"Purchase Count": Purchase_Count, 
                                   "Average Purchase Price": Avg_Purchase_Price, 
                                   "Total Purchase Value": Purchase_Total, 
                                   "Avg Total Purchase per Person": Avg_Purchase_Per_Person})

Gender_Purchasing_df.index.name = "Gender"

Gender_Purchasing_df.style.format({'Average Purchase Price':'${:,.2f}',
                                   'Total Purchase Value': '${:,.2f}',
                                  'Avg Total Purchase per Person': '${:,.2f}'})

#I don't know why my formatting isn't sticking :(

Gender_Purchasing_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [19]:
purchase_data["Age"].max()

45

In [20]:
#Binning(every 4yr), Min 7, Max 45
Age_Bins=[0, 9.90, 14.90, 19.90, 24.90, 29.90, 34.90, 39.90, 99999]
Bin_Names=["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

#Sort Values into Bins
purchase_data["Age Group"] = pd.cut(purchase_data["Age"],Age_Bins, labels=Bin_Names)

purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [21]:
#Groupby
Grouped_Age_df=purchase_data.groupby(["Age Group"])
Grouped_Age_df.count()

           Purchase ID   SN  Age  Gender  Item ID  Item Name  Price
Age Group
<10                 23   23   23      23       23         23     23
10-14               28   28   28      28       28         28     28
15-19              136  136  136     136      136        136    136
20-24              365  365  365     365      365        365    365
25-29              101  101  101     101      101        101    101
30-34               73   73   73      73       73         73     73
35-39               41   41   41      41       41         41     41
40+                 13   13   13      13       13         13     13

In [22]:
#Unique Player Count
Player_Count_Age=Grouped_Age_df["SN"].nunique()
Player_Count_Age

Age Group
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: SN, dtype: int64

In [23]:
Percentage_Players_Age=Player_Count_Age/players_count
Percentage_Players_Age

Age Group
<10      0.029514
10-14    0.038194
15-19    0.185764
20-24    0.447917
25-29    0.133681
30-34    0.090278
35-39    0.053819
40+      0.020833
Name: SN, dtype: float64

In [24]:
Age_Demographics_df=pd.DataFrame({"Total Count": Player_Count_Age, 
                                   "Percentage of Players": Percentage_Players_Age})

Age_Demographics_df.style.format({'Percentage of Players': '{:,.2f}%'})

#Format not coming through again

Age_Demographics_df

           Total Count  Percentage of Players
Age Group
<10                 17               0.029514
10-14               22               0.038194
15-19              107               0.185764
20-24              258               0.447917
25-29               77               0.133681
30-34               52               0.090278
35-39               31               0.053819
40+                 12               0.020833

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [25]:
#Purchase Count
Purchase_Count_Age=Grouped_Age_df["Price"].count()
Purchase_Count_Age

Age Group
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Price, dtype: int64

In [26]:
#Average Purchase Price
Avg_Purchase_Price_Age=Grouped_Age_df["Price"].mean()
Avg_Purchase_Price_Age

Age Group
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [27]:
#Total Purchase Price
Total_Purchase_Value_Age=Grouped_Age_df["Price"].sum()
Total_Purchase_Value_Age

Age Group
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [28]:
#Average Purchase Price/person w/i each Bin
Avg_Purchase_Per_Person_Bin=Total_Purchase_Value_Age/Player_Count_Age
Avg_Purchase_Per_Person_Bin

Age Group
<10      4.537059
10-14    3.762727
15-19    3.858785
20-24    4.318062
25-29    3.805195
30-34    4.115385
35-39    4.763548
40+      3.186667
dtype: float64

In [29]:
Gender_Purchase_Analysis_df=pd.DataFrame({"Purchase Count": Purchase_Count_Age, 
                                   "Average Purchase Price": Avg_Purchase_Price_Age, 
                                   "Total Purchase Value": Total_Purchase_Value_Age, 
                                   "Avg Total Purchase per Person": Avg_Purchase_Per_Person_Bin})


Gender_Purchasing_df.style.format({'Average Purchase Price':'${:,.2f}',
                                   'Total Purchase Value': '${:,.2f}',
                                  'Avg Total Purchase per Person': '${:,.2f}'})

#Can you please explain in notes why my format doesn't work. It's super frustrating

Gender_Purchase_Analysis_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Group,,,,
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [30]:
Grouped_SN_df=purchase_data.groupby("SN")

In [31]:
Purchase_Count_SN=Grouped_SN_df["Purchase ID"].count()

In [32]:
Avg_Purchase_Price_SN=Grouped_SN_df["Price"].mean()

In [33]:
Purchase_Total_SN=Grouped_SN_df["Price"].sum()

In [42]:
Top_Spenders_df=pd.DataFrame({"Purchase Count": Purchase_Count_SN,
                              "Average Purchase Price": Avg_Purchase_Price_SN,
                              "Total Purchase Value": Purchase_Total_SN})


Top_Five=Top_Spenders_df.sort_values(["Total Purchase Value"], ascending=False)

Top_Five.head() #I gave up on formatting

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [51]:
#Groupby Item
Grouped_Item_df=purchase_data.groupby(["Item ID", "Item Name","Price"])
Grouped_Item_df.count()

                                                            Purchase ID  SN  \
Item ID Item Name                                    Price
0       Splinter                                     1.28             4   4
1       Crucifer                                     1.99             1   1
                                                     3.26             3   3
2       Verdict                                      2.48             6   6
3       Phantomlight                                 2.49             6   6
...                                                                 ...  ..
178     Oathbreaker, Last Hope of the Breaking Storm 4.23            12  12
179     Wolf, Promise of the Moonwalker              4.48             6   6
181     Reaper's Toll                                1.66             5   5
182     Toothpick                                    4.03             3   3
183     Dragon's Greatsword                          1.09             3   3

                                                            Age  Gender  \
Item ID Item Name                                    Price
0       Splinter                                     1.28     4       4
1       Crucifer                                     1.99     1       1
                                                     3.26     3       3
2       Verdict                                      2.48     6       6
3       Phantomlight                                 2.49     6       6
...                                                         ...     ...
178     Oathbreaker, Last Hope of the Breaking Storm 4.23    12      12
179     Wolf, Promise of the Moonwalker              4.48     6       6
181     Reaper's Toll                                1.66     5       5
182     Toothpick                                    4.03     3       3
183     Dragon's Greatsword                          1.09     3       3

                                                            Age Group
Item ID Item Name                                    Price
0       Splinter                                     1.28           4
1       Crucifer                                     1.99           1
                                                     3.26           3
2       Verdict                                      2.48           6
3       Phantomlight                                 2.49           6
...                                                               ...
178     Oathbreaker, Last Hope of the Breaking Storm 4.23          12
179     Wolf, Promise of the Moonwalker              4.48           6
181     Reaper's Toll                                1.66           5
182     Toothpick                                    4.03           3
183     Dragon's Greatsword                          1.09           3

[183 rows x 5 columns]

In [69]:
Purchase_Count_Item=Grouped_Item_df["Item Name"].count()

In [70]:
Total_Value_Item=Grouped_Item_df["Price"].sum()

In [71]:
Most_Popular_df=pd.DataFrame({"Purchase Count": Purchase_Count_Item,
                              "Total Purchase Value": Total_Value_Item})

Top_Five_Popular=Most_Popular_df.sort_values(["Purchase Count"], ascending=False)

Top_Five_Popular.head() 
#This is off by one from the solution. I also couldn't figure ou t how to make price not part of the groupby and still show.

,,,Purchase Count,Total Purchase Value
Item ID,Item Name,Price,,
178,"Oathbreaker, Last Hope of the Breaking Storm",4.23,12,50.76
108,"Extraction, Quickblade Of Trembling Hands",3.53,9,31.77
145,Fiery Glass Crusader,4.58,9,41.22
82,Nirvana,4.90,9,44.10
37,"Shadow Strike, Glory of Ending Hope",3.16,8,25.28

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [75]:
Most_Profitable=Most_Popular_df.sort_values(["Total Purchase Value"], ascending=False)
Most_Profitable.head()
#This is not matchaing to the solution. I don't know if my data set is the same because "Final Critic" but it's not the hightest pruchase count like above. This must be becaue I did prices differently.

,,,Purchase Count,Total Purchase Value
Item ID,Item Name,Price,,
178,"Oathbreaker, Last Hope of the Breaking Storm",4.23,12,50.76
82,Nirvana,4.90,9,44.10
145,Fiery Glass Crusader,4.58,9,41.22
92,Final Critic,4.88,8,39.04
103,Singed Scalpel,4.35,8,34.80